# IsElementsDeletionPermitted Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailuresAccessor..::..IsElementsDeletionPermitted Method
FailuresAccessor Class See Also
---
Checks if resolution of the failures by deleting failure elements is permitted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsElementsDeletionPermitted()
```

Visual Basic
---
```text
Public Function IsElementsDeletionPermitted As Boolean
```

Visual C++
---
```text
public:
bool IsElementsDeletionPermitted()
```

# ### Return Value
True if resolution of the failures by deleting failure elements is permitted.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

# See Also
FailuresAccessor Class
IsElementsDeletionPermitted Overload
Autodesk.Revit.DB Namespace